# CLI Tools - Core
brew "git"
brew "gh"
brew "tmux"
brew "zsh"
brew "neovim"
brew "coreutils" # ls, cat, date, timeout 등 핵심 유틸리티 모음
brew "moreutils" # ts, vidir, sponge, ifdata 등 실무용 유틸 모음
brew "findutils" # GNU find, xargs, locate
brew "gnu-sed" # GNU sed: macOS 기본 sed는 BSD 계열로 옵션 차이가 큼
brew "grep" # GNU grep
brew "openssh"
brew "readline" # CLI 입력 편집 라이브러리, Python 등 기타 인터프리터 환경에 영향
brew "xz" # 고효율 압축 .xz 포맷 지원

# CLI Tools - Process & System
brew "htop"
brew "gotop"
brew "pstree" # 프로세스 관계를 트리 형태로 시각화, 데몬/자식 프로세스 구조 파악에 유용
brew "dockutil" # macOS Dock 항목을 CLI로 관리

# CLI Tools - File & Text
brew "bat" # A cat(1) clone with syntax highlighting
brew "lsd" # A rewrite of GNU ls with lot of added features like colors, icons etc.
brew "glow" # markdown viewer
brew "tree"
brew "wget"
brew "trash"
brew "psgrep" # ps aux | grep xxx 패턴을 대체
brew "watch" # 명령어를 주기적으로 실행해 결과 갱신, watch -n 1 netstat 등

# CLI Tools - Shell & Development
brew "shellcheck" # Static analysis and lint tool for (ba)sh scripts
brew "fzf" # 강력한 fuzzy finder
brew "peco" # 단순하고 빠른 인터랙티브 필터링 도구, history | peco, git branch | peco, fzf보다 직관적

# CLI Tools - Git
brew "pre-commit"
brew "git-extras" # summary, authors, ignore, effort, changelog
brew "git-flow" # Git FLow Branch 전략을 CLI로 표준화, git flow init/feature start/end 등
brew "diff-so-fancy" # git diff 출력을 가독성 좋게 포매팅

# Dev utils
brew "opencode"

# Taps
tap "anomalyco/tap"

# Casks
brew "mas"
cask "caffeine"
cask "rectangle"
cask "google-chrome"
cask "notion"
cask "slack"
cask "appcleaner"
cask "ghostty"
cask "visual-studio-code"

# Utilities
brew "notion-calendar"
